{
    "eulaTitle": "许可应用程序最终用户许可协议",
    "eulaContent": "a.通过App Store提供的应用程序是许可给您使用的,而非出售给您。您对每个应用程序的许可须事先接受本许可应用程序最终用户许可协议(\"标准最终用户许可协议\")或您与应用程序供应商之间的自定义最终用户许可协议(\"自定义最终用户许可协议\")。根据本标准最终用户许可协议或自定义最终用户许可协议,您获得对任何Apple应用程序的许可由Apple授予,您获得对任何第三方应用程序的许可由该第三方应用程序的应用程序供应商授予。本标准最终用户许可协议所指的\"许可应用程序\"是指受本协议约束的任何应用程序。应用程序供应商或Apple(\"许可方\")保留本标准最终用户许可协议未明确授予您的对许可应用程序的所有权利。\n\n b.许可范围:许可方授予您一项不可转让的许可,以便您在自己拥有或控制的任何Apple品牌产品上使用许可应用程序,并须遵守使用规则。本标准最终用户许可协议的条款将适用于可从许可应用程序访问或在许可应用程序内购买的任何内容、材料或服务,以及许可方提供的替换或补充原始许可应用程序的任何升级,除非该升级附有自定义最终用户许可协议。除使用规则另有规定外,您不得在网络上分发或提供许可应用程序供多台设备同时使用。您不得转让、再分发或再许可许可应用程序,如果您将您的Apple设备出售给第三方,您必须在此之前从Apple设备中删除许可应用程序。您不得复制(除本许可证和使用规则允许的情况外)、反向工程、反汇编、尝试导出许可应用程序、任何更新或其任何部分的源代码、修改或创建其衍生作品(除非并且只有在适用法律明确禁止前述限制的情况下,或在许可应用程序所包含的任何开源组件的许可条款允许的范围内)。\n\n c.同意使用数据:您同意,许可方可以收集和使用技术数据和相关信息,包括但不限于关于您的设备、系统和应用软件以及外围设备的技术信息,该等信息是定期收集的,以便向您提供与许可应用程序相关的软件更新、产品支持和其他服务(如有)。只要其形式不会将您本人识别出来,许可方就可使用此类信息改善其产品或向您提供服务或技术。\n\n d.终止。本标准最终用户许可协议在您或许可方终止之前一直有效。如果您未能遵守本协议任何条款,您在本标准最终用户许可协议项下的权利将自动终止。\n\n e.外部服务。许可应用程序可能使您能够访问许可方和/或第三方的服务和网站(统称为\"外部服务\")。您同意自行承担使用此类外部服务的风险。许可方无需审查或评估任何第三方外部服务的内容或准确性,对任何此类第三方外部服务也不承担责任。许可应用程序或外部服务显示的任何数据(包括但不限于财务、医疗和位置信息)仅供一般参考,许可方及其代理人不对此类数据作出任何保证。您不得以与本标准最终用户许可协议条款不一致或侵犯许可方或任何第三方知识产权的方式使用外部服务。您同意不会使用外部服务骚扰、虐待、跟踪、威胁或诽谤任何个人或实体,许可方对任何此类使用行为概不负责。外部服务可能无法以所有语言或在您所在国家/地区提供,也可能因地区而不适合或无法使用。在您选择使用此类外部服务的范围内,您须自行负责遵守任何适用法律。许可方保留随时更改、暂停、移除或禁用任何外部服务或实施访问限制的权利,恕不另行通知,对您也不承担任何责任。\n\n f.不作出担保:您明确承认并同意,使用许可应用程序存在风险,应自行承担任何风险。在适用法律允许的最大范围内,许可应用程序和许可应用程序执行或提供的任何服务是\"按现状\"和\"可获得的\"提供的,包含所有缺陷和不作任何种类的担保,许可方在此明确排除一切明示、默示或法定的担保和条件,包括但不限于有关适销性、质量满意、适合特定目的、准确性、不受干扰使用及不侵犯第三方权利的默示担保和/或条件。许可方及其授权代表不作任何明示担保。如许可应用程序或服务存在缺陷,您应自行承担所有必要的维修、修理或纠正费用。某些国家地区不允许排除默示担保或对适用法定消费者权利施加限制,因此上述排除和限制可能不适用于您\n\n g.除非获得美国法律和您获得许可应用程序所在司法管辖区的法律授权,否则您不得使用或以其他方式出口或再出口许可应用程序。特别是,但不限于以下情况:许可应用程序不得出口或再出口(a)至任何受美国禁运的国家,或(b)给予任何列于美国财政部的特别指定国民名单或美国商务部的被拒绝人员名单或实体名单上的任何人。通过使用许可应用程序,您声明和保证您并非位于任何此类国家或列于任何此类名单上。您还同意不会将这些产品用于美国法律禁止的任何目的,包括但不限于开发、设计、制造或生产核武器、导弹或化学或生物武器。\n\n h.许可应用程序和相关文档是\"商业项目\",该术语的定义见48 C.F.R. §2.101,由\"商用计算机软件\"和\"商用计算机软件文档\"组成,如同在48 C.F.R. §12.212或48 C.F.R. §227.7202中所使用的该等术语。根据适用的48 C.F.R. §12.212或48 C.F.R. §227.7202-1至227.7202-4,商用计算机软件和商用计算机软件文档(a)仅作为商业项目而被许可给美国政府的最终用户,以及(b)只附有根据本文条款和条件授予所有其他最终用户的权利。未授予权利均受美国版权法保护。\n\n i.除下一段明确规定的情况外,本协议以及您与Apple之间的关系均受加利福尼亚州法律管辖,但不包括其法律冲突原则。您和Apple同意,由位于加利福尼亚州圣克拉拉县的法院专属审理并解决因本协议引起或与之相关的任何争议或索赔。如果(a)您不是美国公民;(b)您不居住在美国;(c)您不是从美国访问本服务;以及(d)您是下列某一国家的公民,那么您在此同意,任何因本协议引起的争议或索赔均应适用下列所列的相应法律(但不考虑法律冲突原则),且您不可撤销地接受下列所列适用法律所在的州、省或国家的非专属法院管辖权:如果您是任何欧盟国家、瑞士、挪威或冰岛的公民,则适用法律和法院为您惯常居住地的法律和法院。明确排除不适用于本协议的是《联合国国际货物销售合同公约》。"
}