{
    "eulaTitle": "許可應用程序最終用戶許可協議",
    "eulaContent": "a.通過App Store提供的應用程序是許可給您使用的,而非出售給您。您對每個應用程序的許可須事先接受本許可應用程序最終用戶許可協議(\"標準最終用戶許可協議\")或您與應用程序提供商之間的自定義最終用戶許可協議(\"自定義最終用戶許可協議\")。根據本標準最終用戶許可協議或自定義最終用戶許可協議,您獲得對任何Apple應用程序的許可由Apple授予,您獲得對任何第三方應用程序的許可由該第三方應用程序的應用程序提供商授予。本標準最終用戶許可協議所指的\"許可應用程序\"是指受本協議約束的任何應用程序。應用程序提供商或Apple(\"許可方\")保留本標準最終用戶許可協議未明確授予您的對許可應用程序的所有權利。 \n\nb.許可範圍:許可方授予您一項不可轉讓的許可,以便您在自己擁有或控製的任何Apple品牌産品上使用許可應用程序,並須遵守使用規則。本標準最終用戶許可協議的條款將適用於可從許可應用程序訪問或在許可應用程序內購買的任何內容、材料或服務,以及許可方提供的替換或補充原始許可應用程序的任何昇級,除非該昇級附有自定義最終用戶許可協議。除使用規則另有規定外,您不得在網絡上分髮或提供許可應用程序供多颱設備同時使用。您不得轉讓、再分髮或再許可許可應用程序,如果您將您的Apple設備出售給第三方,您必須在此之前從Apple設備中刪除許可應用程序。您不得複製(除本許可証和使用規則允許的情況外)、反向工程、反匯編、嚐試導出許可應用程序、任何更新或其任何部分的源代碼、修改或創建其衍生作品(除非並且隻有在適用法律明確禁止前述限製的情況下,或在許可應用程序所包含的任何開源組件的許可條款允許的範圍內)。 \n\nc.同意使用數據:您同意,許可方可以收集和使用技術數據和相關信息,包括但不限於關於您的設備、繫統和應用軟件以及外圍設備的技術信息,該等信息是定期收集的,以便向您提供與許可應用程序相關的軟件更新、産品支持和其他服務(如有)。隻要其形式不會將您本人識別出來,許可方就可使用此類信息改善其産品或向您提供服務或技術。 \n\nd.終止。本標準最終用戶許可協議在您或許可方終止之前一直有效。如果您未能遵守本協議任何條款,您在本標準最終用戶許可協議項下的權利將自動終止。 \n\ne.外部服務。許可應用程序可能使您能夠訪問許可方和/或第三方的服務和網站(統稱爲\"外部服務\")。您同意自行承擔使用此類外部服務的風險。許可方無需審查或評估任何第三方外部服務的內容或準確性,對任何此類第三方外部服務也不承擔責任。許可應用程序或外部服務顯示的任何數據(包括但不限於財務、醫療和位置信息)僅供一般參考,許可方及其代理人不對此類數據作出任何保証。您不得以與本標準最終用戶許可協議條款不一緻或侵犯許可方或任何第三方知識産權的方式使用外部服務。您同意不會使用外部服務騷擾、虐待、跟踪、威脅或誹謗任何個人或實體,許可方對任何此類使用行爲概不負責。外部服務可能無法以所有語言或在您所在國家/地區提供,也可能因地區而不適合或無法使用。在您選擇使用此類外部服務的範圍內,您須自行負責遵守任何適用法律。許可方保留隨時更改、暫停、移除或禁用任何外部服務或實施訪問限製的權利,恕不另行通知,對您也不承擔任何責任。 \n\nf.不作出擔保:您明確承認並同意,使用許可應用程序存在風險,應自行承擔任何風險。在適用法律允許的最大範圍內,許可應用程序和許可應用程序執行或提供的任何服務是\"按現狀\"和\"可獲得的\"提供的,包含所有缺陷和不作任何種類的擔保,許可方在此明確排除一切明示、默示或法定的擔保和條件,包括但不限於有關適銷性、質量滿意、適合特定目的、準確性、不受幹擾使用及不侵犯第三方權利的默示擔保和/或條件。許可方及其授權代表不作任何明示擔保。如許可應用程序或服務存在缺陷,您應自行承擔所有必要的維修、修理或糾正費用。某些國家地區不允許排除默示擔保或對適用法定消費者權利施加限製,因此上述排除和限製可能不適用於您 \n\ng. 除非獲得美國法律和您獲得許可應用程序所在司法管轄區的法律授權,否則您不得使用或以其他方式出口或再出口許可應用程序。特別是,但不限於以下情況:許可應用程序不得出口或再出口(a)至任何受美國禁運的國家,或(b)給予任何列於美國財政部的特別指定國民名單或美國商務部的被拒絶人員名單或實體名單上的任何人。通過使用許可應用程序,您聲明和保証您並非位於任何此類國家或列於任何此類名單上。您還同意不會將這些産品用於美國法律禁止的任何目的,包括但不限於開髮、設計、製造或生産核武器、導彈或化學或生物武器。 \n\nh. 許可應用程序和相關文檔是\"商業項目\",該術語的定義見48 C.F.R. §2.101,由\"商用計算機軟件\"和\"商用計算機軟件文檔\"組成,如同在48 C.F.R. §12.212或48 C.F.R. §227.7202中所使用的該等術語。根據適用的48 C.F.R. §12.212或48 C.F.R. §227.7202-1至227.7202-4,商用計算機軟件和商用計算機軟件文檔(a)僅作爲商業項目而被許可給美國政府的最終用戶,以及(b)隻附有根據本文條款和條件授予所有其他最終用戶的權利。未髮佈權利均受美國版權法保留。 \n\ni. 除下一段明確規定的情況外,本協議以及您與Apple之間的關繫均受加利福尼亞州法律管轄,但不包括其法律衝突原則。您和Apple同意,由位於加利福尼亞州聖克拉拉縣的法院專屬審理並解決因本協議引起或與之相關的任何爭議或索賠。如果(a)您不是美國公民;(b)您不居住在美國;(c)您不是從美國訪問本服務;以及(d)您是下列某一國家的公民,那麼您在此同意,任何因本協議引起的爭議或索賠均應適用下列所列的相應法律(但不考慮法律衝突原則),且您不可撤銷地接受下列所列適用法律所在的州、省或國家的非專屬法院管轄權:如果您是任何歐盟國家、瑞士、挪威或冰島的公民,則適用法律和法院爲您慣常居住地的法律和法院。明確排除不適用於本協議的是《聯合國國際貨物銷售合同公約》。"
}
  